In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

print("Labels:", labels)
print('my_data:', my_data)
print('Dictionary:', d)
pd.Series(my_data, index = labels)

Labels: ['a', 'b', 'c']
my_data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [3]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
#Assigning nem Indexs
pd.Series(my_data, index =[2,3,4] )

2    10
3    20
4    30
dtype: int64

In [5]:
pd.Series(my_data, index =['Fabian', 'Stefi', 'franci'] ) # We can give any such values as a index.

Fabian    10
Stefi     20
franci    30
dtype: int64

In [6]:
F = pd.Series(my_data, index =['Fabian', 'Stefi', 'franci'] ) # We can give any such values as a index.
F

Fabian    10
Stefi     20
franci    30
dtype: int64

In [7]:
F["Stefi"]

20

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [9]:
pd.Series(arr, index = [5,6,7])

5    10
6    20
7    30
dtype: int32

In [10]:
pd.Series(arr, index = [5,6,7])[6]

20

In [11]:
# Dictionaries into Series

d = {'a':10, 'b':20, 'c':30}

In [12]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(d)[2]

30

In [14]:
pd.Series([5,6,7], index = ['f', 'b', 2])

f    5
b    6
2    7
dtype: int64

In [15]:
pd.Series([5,6,7], index = ['f', 'b', 2])['f'] #asscesing data.

5

In [16]:
d = {'a':10, 'b':20, 'c':30}

pd.DataFrame(d,index = ['a','b','c'])

    a   b   c
a  10  20  30
b  10  20  30
c  10  20  30

In [17]:
F = pd.Series(my_data, index=labels)

In [18]:
F

a    10
b    20
c    30
dtype: int64

In [19]:
F = pd.Series(my_data, index=labels)[2]

In [20]:
F

30

In [21]:
d

{'a': 10, 'b': 20, 'c': 30}

In [22]:
pd.DataFrame(d, index=['X','Y','Z'])

    a   b   c
X  10  20  30
Y  10  20  30
Z  10  20  30

In [23]:
pd.Series([type, max, sum, min])

0             <class 'type'>
1    <built-in function max>
2    <built-in function sum>
3    <built-in function min>
dtype: object

In [24]:
ser1 = pd.Series([1,2,3,4], index = [2,3,4,5])
ser1

2    1
3    2
4    3
5    4
dtype: int64

In [25]:
ser1[0:4]

2    1
3    2
4    3
5    4
dtype: int64

In [26]:
ser1[1:0:4]

Series([], dtype: int64)

In [27]:
ser1[0:3:2]

2    1
4    3
dtype: int64

In [28]:
l = [3,4,5,6]

In [29]:
h = pd.Series([1,2,3,4], index =1)
h

TypeError: Index(...) must be called with a collection of some kind, 1 was passed

In [36]:
ser1 = pd.Series([1,2,3,4], ['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4], ['CA', 'NV', 'AZ', 'CA'])
ser3 = ser1 + ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CA    5.0
CA    8.0
CO    NaN
NV    NaN
OR    NaN
dtype: float64

In [37]:
ser1

CA    1
OR    2
CO    3
CA    4
dtype: int64

In [38]:
ser2

CA    1
NV    2
AZ    5
CA    4
dtype: int64

In [39]:
ser1*ser2

AZ     NaN
CA     1.0
CA     4.0
CA     4.0
CA    16.0
CO     NaN
NV     NaN
OR     NaN
dtype: float64

In [40]:
from numpy.random import randn as rn
rn(4,3)

array([[-0.39818145, -0.36024908,  0.131611  ],
       [ 0.6353746 ,  1.04226958,  0.74546053],
       [-0.89563146,  1.35296838,  1.6607646 ],
       [-0.58143869,  0.18943756,  2.18223219]])

In [41]:
pd.DataFrame(rn(4,3))

          0         1         2
0 -0.919661 -0.166651  0.309043
1 -0.927360 -0.619513  0.341811
2  2.034760  0.010316 -0.657090
3 -0.011996 -1.070891  0.307930

In [42]:
df = pd.DataFrame(rn(4,3), index = ['a', 'b', 'c', 'd'], columns = ['x','y','z']) # Adding column head and index
df

          x         y         z
a  1.181065  0.562115  0.818412
b  0.625405 -0.091621 -1.045258
c  1.020588  0.870967  0.609503
d -0.468701 -1.010994 -0.543351

In [43]:
df[['x','y']]

          x         y
a  1.181065  0.562115
b  0.625405 -0.091621
c  1.020588  0.870967
d -0.468701 -1.010994

In [44]:
df.iloc[a]

NameError: name 'a' is not defined

In [45]:
df.iloc[0]

x    1.181065
y    0.562115
z    0.818412
Name: a, dtype: float64

In [46]:
pd.DataFrame(rn(4,4), index = ['4', '5', '6', '7'], columns = ['w','x','y','z']) # Adding column head and index

          w         x         y         z
4 -0.841843 -0.747865  0.407935  1.028304
5  0.033414  0.219648 -0.324548  1.130182
6 -0.949985  1.709707 -0.802540 -0.166448
7 -0.618403  0.159860 -0.608416  0.614779

In [47]:
df = pd.DataFrame(rn(4,4), index = ['4', '5', '6', '7'], columns = ['w','x','y','z']) # Adding column head and index

In [48]:
df['New_col'] = df['y'] + df['z']
df

          w         x         y         z   New_col
4  0.422765  0.790543  0.557474 -0.969319 -0.411845
5  2.118003 -0.359858  0.365561  1.563149  1.928710
6 -0.863423  1.652979  0.729983  0.327944  1.057927
7 -0.266481 -0.056775  0.540544  1.329906  1.870450

In [50]:
df['W and Z '] = df['w'] + df['z']
df

          w         x         y         z   New_col  W and Z
4  0.422765  0.790543  0.557474 -0.969319 -0.411845 -0.546554
5  2.118003 -0.359858  0.365561  1.563149  1.928710  3.681152
6 -0.863423  1.652979  0.729983  0.327944  1.057927 -0.535479
7 -0.266481 -0.056775  0.540544  1.329906  1.870450  1.063425

In [55]:
df.drop('y' , axis =1)

          w         x         z   New_col  W and Z
4  0.422765  0.790543 -0.969319 -0.411845 -0.546554
5  2.118003 -0.359858  1.563149  1.928710  3.681152
6 -0.863423  1.652979  0.327944  1.057927 -0.535479
7 -0.266481 -0.056775  1.329906  1.870450  1.063425

In [65]:
df

          w         x         z   New_col  W and Z
4  0.422765  0.790543 -0.969319 -0.411845 -0.546554
5  2.118003 -0.359858  1.563149  1.928710  3.681152
6 -0.863423  1.652979  0.327944  1.057927 -0.535479
7 -0.266481 -0.056775  1.329906  1.870450  1.063425

In [66]:
df

          w         x         z   New_col  W and Z
4  0.422765  0.790543 -0.969319 -0.411845 -0.546554
5  2.118003 -0.359858  1.563149  1.928710  3.681152
6 -0.863423  1.652979  0.327944  1.057927 -0.535479
7 -0.266481 -0.056775  1.329906  1.870450  1.063425

In [67]:
df.iloc[3]

w          -0.266481
x          -0.056775
z           1.329906
New_col     1.870450
W and Z     1.063425
Name: 7, dtype: float64

In [69]:
df.loc[['4','5']]

          w         x         z   New_col  W and Z
4  0.422765  0.790543 -0.969319 -0.411845 -0.546554
5  2.118003 -0.359858  1.563149  1.928710  3.681152

In [70]:
df.loc[['4','5']]['z'] #First method

4   -0.969319
5    1.563149
Name: z, dtype: float64

In [73]:
df.loc[['4','5'],'z'] # another method

4   -0.969319
5    1.563149
Name: z, dtype: float64

In [76]:
df.loc[['4','5'],['w','z']] # Very important method for asscessing the data from the table

          w         z
4  0.422765 -0.969319
5  2.118003  1.563149

In [78]:
df.loc[ :,['w','z']]

          w         z
4  0.422765 -0.969319
5  2.118003  1.563149
6 -0.863423  0.327944
7 -0.266481  1.329906

In [80]:
df.iloc[0,1]

0.7905428324947694

In [81]:
df.iloc[[0,1]]

          w         x         z   New_col  W and Z
4  0.422765  0.790543 -0.969319 -0.411845 -0.546554
5  2.118003 -0.359858  1.563149  1.928710  3.681152

In [82]:
df.iloc[[1,0]]

          w         x         z   New_col  W and Z
5  2.118003 -0.359858  1.563149  1.928710  3.681152
4  0.422765  0.790543 -0.969319 -0.411845 -0.546554

In [83]:
df.iloc[0]

w           0.422765
x           0.790543
z          -0.969319
New_col    -0.411845
W and Z    -0.546554
Name: 4, dtype: float64

In [84]:
df.iloc[0,[2,3]]

z         -0.969319
New_col   -0.411845
Name: 4, dtype: float64

In [85]:
df>0

       w      x      z  New_col  W and Z
4   True   True  False    False     False
5   True  False   True     True      True
6  False   True   True     True     False
7  False  False   True     True      True

In [86]:
df[df>0]

          w         x         z   New_col  W and Z
4  0.422765  0.790543       NaN       NaN       NaN
5  2.118003       NaN  1.563149  1.928710  3.681152
6       NaN  1.652979  0.327944  1.057927       NaN
7       NaN       NaN  1.329906  1.870450  1.063425

In [87]:
df.loc[['4','5','6',]]>

       w      x      z  New_col  W and Z
4   True   True  False    False     False
5   True  False   True     True      True
6  False   True   True     True     False

In [88]:
df[df.loc[['4','5','6',]]>0]

          w         x         z   New_col  W and Z
4  0.422765  0.790543       NaN       NaN       NaN
5  2.118003       NaN  1.563149  1.928710  3.681152
6       NaN  1.652979  0.327944  1.057927       NaN
7       NaN       NaN       NaN       NaN       NaN

In [90]:
import pandas as pd
import numpy as np

In [92]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A', 'B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [93]:
df = pd.DataFrame(data=matrix_data, index = row_labels, columns = column_headings)
df

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [95]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [94]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [96]:
df[(df['Height']>65) & (df['Weight']<170)]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [97]:
df[(df['Height']>65) | (df['Weight']<170)]   # or

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [99]:
df[(df['Height']>65) | (df['Weight']<170)  & (df['Age']>25)]   # or  # another method (np.where)

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160

In [100]:
df[((df['Height']>65) | (df['Weight']<170))  & (df['Age']<50)]

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [101]:
df.reset_index()

  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [102]:
df.reset_index(drop=True)

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [103]:
df.reset_index(drop=True, inplace = True)

In [104]:
df

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [106]:
df.set_index('Age')

     Height  Weight
Age
22       66     140
42       70     148
30       62     125
35       68     160
25       62     152

In [107]:
df.set_index('Weight')

        Age  Height
Weight
140      22      66
148      42      70
125      30      62
160      35      68
152      25      62

In [108]:
# Multi Indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [109]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [118]:
df1 = pd.DataFrame(data=np.round(rn(6,3)), index = hier_index, columns = ['A','B','C'])
df1

           A    B    C
(G1, 1) -1.0 -0.0 -1.0
(G1, 2)  1.0 -1.0  3.0
(G1, 3) -1.0 -2.0 -0.0
(G2, 1) -2.0 -0.0 -1.0
(G2, 2) -1.0 -0.0  1.0
(G2, 3) -1.0  0.0  1.0

# 19th Sep 2020 Class

In [122]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [125]:
'F a b'.split()

['F', 'a', 'b']

In [126]:
type('F a b'.split())

list

In [129]:
df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,np.nan, np.nan], 'C':[1,2,3]})
df
df["States"]= 'F a b'.split()
df

     A    B  C States
0  1.0  5.0  1      F
1  2.0  NaN  2      a
2  NaN  NaN  3      b

In [130]:
df.set_index('States')

          A    B  C
States
F       1.0  5.0  1
a       2.0  NaN  2
b       NaN  NaN  3

In [131]:
df.dropna()

     A    B  C States
0  1.0  5.0  1      F

In [132]:
df.dropna(axis=1)

   C States
0  1      F
1  2      a
2  3      b

In [133]:
df

     A    B  C States
0  1.0  5.0  1      F
1  2.0  NaN  2      a
2  NaN  NaN  3      b

In [134]:
df.dropna(axis = 0, thresh =1)

     A    B  C States
0  1.0  5.0  1      F
1  2.0  NaN  2      a
2  NaN  NaN  3      b

In [135]:
df.dropna(axis = 0, thresh =2)

     A    B  C States
0  1.0  5.0  1      F
1  2.0  NaN  2      a
2  NaN  NaN  3      b

In [136]:
df.dropna(axis = 0, thresh =3)

     A    B  C States
0  1.0  5.0  1      F
1  2.0  NaN  2      a

In [137]:
df.dropna(axis = 1, thresh =3)

   C States
0  1      F
1  2      a
2  3      b

In [138]:
df.fillna(value='FILL VALUE')

            A           B  C States
0           1           5  1      F
1           2  FILL VALUE  2      a
2  FILL VALUE  FILL VALUE  3      b

In [140]:
df.fillna(value='FABI')

      A     B  C States
0     1     5  1      F
1     2  FABI  2      a
2  FABI  FABI  3      b

In [139]:
df.fillna(value=df['A'].mean())

     A    B  C States
0  1.0  5.0  1      F
1  2.0  1.5  2      a
2  1.5  1.5  3      b

In [149]:
# Create a Dataframe

data = {'Company': ['Google', 'IBM', 'FB', 'Google', 'IBM', 'FB'],
       'Person': ['Sam', 'Charlie', 'Rajesh', 'Kavi', 'Raji', 'Francy'],
       'Sales': [200, 120, 340, 124, 243,350]}
df= pd.DataFrame(data)
df

  Company   Person  Sales
0  Google      Sam    200
1     IBM  Charlie    120
2      FB   Rajesh    340
3  Google     Kavi    124
4     IBM     Raji    243
5      FB   Francy    350

In [150]:
list(df.groupby('Company'))

[('FB',
    Company  Person  Sales
  2      FB  Rajesh    340
  5      FB  Francy    350),
 ('Google',
    Company Person  Sales
  0  Google    Sam    200
  3  Google   Kavi    124),
 ('IBM',
    Company   Person  Sales
  1     IBM  Charlie    120
  4     IBM     Raji    243)]

In [151]:
for i in df.groupby('Company'):
    print(i)

('FB',   Company  Person  Sales
2      FB  Rajesh    340
5      FB  Francy    350)
('Google',   Company Person  Sales
0  Google    Sam    200
3  Google   Kavi    124)
('IBM',   Company   Person  Sales
1     IBM  Charlie    120
4     IBM     Raji    243)

In [155]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  345.0   7.071068  340.0  342.50  345.0  347.50  350.0
Google    2.0  162.0  53.740115  124.0  143.00  162.0  181.00  200.0
IBM       2.0  181.5  86.974134  120.0  150.75  181.5  212.25  243.0

In [156]:
df.groupby('Company').mean()

         Sales
Company
FB       345.0
Google   162.0
IBM      181.5

In [157]:
df1= df.groupby('Company').describe()
df1

        Sales
        count   mean        std    min     25%    50%     75%    max
Company
FB        2.0  345.0   7.071068  340.0  342.50  345.0  347.50  350.0
Google    2.0  162.0  53.740115  124.0  143.00  162.0  181.00  200.0
IBM       2.0  181.5  86.974134  120.0  150.75  181.5  212.25  243.0

In [159]:
df1.columns

MultiIndex([('Sales', 'count'),
            ('Sales',  'mean'),
            ('Sales',   'std'),
            ('Sales',   'min'),
            ('Sales',   '25%'),
            ('Sales',   '50%'),
            ('Sales',   '75%'),
            ('Sales',   'max')],
           )

In [161]:
df1['Sales']['min'][0]

340.0

In [162]:
df1.loc[['FB']]

        Sales
        count   mean       std    min    25%    50%    75%    max
Company
FB        2.0  345.0  7.071068  340.0  342.5  345.0  347.5  350.0

In [165]:
df1.loc['FB'].loc['Sales']

count      2.000000
mean     345.000000
std        7.071068
min      340.000000
25%      342.500000
50%      345.000000
75%      347.500000
max      350.000000
Name: FB, dtype: float64

In [166]:
df1.loc['FB'].loc['Sales']['min']

340.0

In [168]:
(df.groupby('Company').describe().loc['FB']).transpose()

Sales  count      2.000000
       mean     345.000000
       std        7.071068
       min      340.000000
       25%      342.500000
       50%      345.000000
       75%      347.500000
       max      350.000000
Name: FB, dtype: float64

In [172]:
pd.DataFrame(df.groupby('Company').describe().loc['FB'])

                     FB
Sales count    2.000000
      mean   345.000000
      std      7.071068
      min    340.000000
      25%    342.500000
      50%    345.000000
      75%    347.500000
      max    350.000000

In [173]:
pd.DataFrame(df.groupby('Company').describe().loc['FB']).transpose()

   Sales
   count   mean       std    min    25%    50%    75%    max
FB   2.0  345.0  7.071068  340.0  342.5  345.0  347.5  350.0

In [174]:
pd.DataFrame(df.groupby('Company').describe().loc['FB']).T

   Sales
   count   mean       std    min    25%    50%    75%    max
FB   2.0  345.0  7.071068  340.0  342.5  345.0  347.5  350.0

# Concatenation

In [183]:
#Merging two data frames
# Creating data frames

df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'],
              'B': ['B0','B1','B2','B3'],
              'C': ['C0','C1','A2','C3'],
              'D': ['D0','D1','D2','D3']},
                index = [0,1,2,3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  A2  D2
3  A3  B3  C3  D3

In [184]:
df2 = pd.DataFrame({'A': ['A4','A5','A6','A7'],
              'B': ['B4','B5','B6','B7'],
              'C': ['C4','C5','A6','C7'],
              'D': ['D4','D5','D6','D7']},
                index = [4,5,6,7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  A6  D6
7  A7  B7  C7  D7

In [185]:
df3 = pd.DataFrame({'A': ['A8','A9','A10','A11'],
              'B': ['B8','B9','B10','B11'],
              'C': ['C8','C9','A10','C11'],
              'D': ['D8','D9','D10','D11']},
                index = [8,9,10,11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  A10  D10
11  A11  B11  C11  D11

In [187]:
df = pd.concat([df1,df2,df3])
df

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   A2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   A6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  A10  D10
11  A11  B11  C11  D11

In [188]:
df.iloc[3]

A    A3
B    B3
C    C3
D    D3
Name: 3, dtype: object

In [189]:
df.loc[3]

A    A3
B    B3
C    C3
D    D3
Name: 3, dtype: object

In [190]:
pd.concat([df1,df2,df3], axis =1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   A2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   A6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  A10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [198]:
# Merging by a common key

d1 = pd.DataFrame({'Key':['KO', 'K8','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})


d2 = pd.DataFrame({'Key':['KO', 'K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [199]:
d1

  Key   A   B
0  KO  A0  B0
1  K8  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [200]:
d2

  Key   C   D
0  KO  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [201]:
pd.merge(d1,d2) # Only common elements can merge.

  Key   A   B   C   D
0  KO  A0  B0  C0  D0
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [203]:
pd.merge(d1,d2, how = 'left')

  Key   A   B    C    D
0  KO  A0  B0   C0   D0
1  K8  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [204]:
pd.merge(d1,d2, how = 'right')

  Key    A    B   C   D
0  KO   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3   A3   B3  C3  D3
3  K1  NaN  NaN  C1  D1

In [205]:
pd.merge(d1,d2, how = 'outer')

  Key    A    B    C    D
0  KO   A0   B0   C0   D0
1  K8   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K1  NaN  NaN   C1   D1

In [206]:
left = pd.DataFrame({'Key1':['KO', 'K0','K1','K2'],
                   'Key2':['KO', 'K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})


right = pd.DataFrame({'Key1':['KO', 'K1','K1','K2'],
                   'Key2':['KO', 'KO','KO','KO'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [207]:
left

  Key1 Key2   A   B
0   KO   KO  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [208]:
right

  Key1 Key2   C   D
0   KO   KO  C0  D0
1   K1   KO  C1  D1
2   K1   KO  C2  D2
3   K2   KO  C3  D3

In [ ]:
pd.merge(left,right,on=['key1','key2'])

In [230]:
df = pd.DataFrame({'Col1':[1,2,3,4,5,6,7,8,9,10],
                  'Col2':[444,555,333,444,333,222,111,777,888,444],
                  'Col3':[444,555,333,444,333,222,111,777,888,444]})

df

   Col1  Col2  Col3
0     1   444   444
1     2   555   555
2     3   333   333
3     4   444   444
4     5   333   333
5     6   222   222
6     7   111   111
7     8   777   777
8     9   888   888
9    10   444   444

In [219]:
df['New']= df['Col2'].apply(lambda x :x/10)
df

   Col1  Col2  Col3   New
0     1   444   444  44.4
1     2   555   555  55.5
2     3   333   333  33.3
3     4   444   444  44.4
4     5   333   333  33.3
5     6   222   222  22.2
6     7   111   111  11.1
7     8   777   777  77.7
8     9   888   888  88.8
9    10   444   444  44.4

In [220]:
def test(x):
    return x/10

In [221]:
df['New']= df['Col2'].apply(test)  # another method editing the column with numbers.
df

   Col1  Col2  Col3   New
0     1   444   444  44.4
1     2   555   555  55.5
2     3   333   333  33.3
3     4   444   444  44.4
4     5   333   333  33.3
5     6   222   222  22.2
6     7   111   111  11.1
7     8   777   777  77.7
8     9   888   888  88.8
9    10   444   444  44.4

In [222]:
def test(x):
    return x+25/7
df['New']= df['Col2'].apply(test)  # another method editing the column with numbers.
df

   Col1  Col2  Col3         New
0     1   444   444  447.571429
1     2   555   555  558.571429
2     3   333   333  336.571429
3     4   444   444  447.571429
4     5   333   333  336.571429
5     6   222   222  225.571429
6     7   111   111  114.571429
7     8   777   777  780.571429
8     9   888   888  891.571429
9    10   444   444  447.571429

In [225]:
def test(x):
    if x <500:
        return x/35
    else:
        return x+100
df['New']= df['Col2'].apply(test)  # another method editing the column with numbers.
df

   Col1  Col2  Col3         New
0     1   444   444   12.685714
1     2   555   555  655.000000
2     3   333   333    9.514286
3     4   444   444   12.685714
4     5   333   333    9.514286
5     6   222   222    6.342857
6     7   111   111    3.171429
7     8   777   777  877.000000
8     9   888   888  988.000000
9    10   444   444   12.685714

In [226]:
def test1(x):
    return len(x)

In [228]:
df['lenth_Col3']= df['Col3'].apply(test1)

TypeError: object of type 'int' has no len()

In [232]:
df.sort_values(by='Col2',ascending=False)

   Col1  Col2  Col3
8     9   888   888
7     8   777   777
1     2   555   555
0     1   444   444
3     4   444   444
9    10   444   444
2     3   333   333
4     5   333   333
5     6   222   222
6     7   111   111

# 20th Sep 2020 Class

# Numpy Array